{
    "Articles": [
        {
            "title": "Elementary Data Structures",
            "date": "07/03/2020",
            "summary": "Unlike mathematical sets, dynamic sets can be manipulated to grow, shrink, and change over time by an algorithm. In a common implementation of a dynamic set, each element is represented as an object whose attributes e.g. key is tractable with a pointer. Elementary data structures such as stacks, queues, and linked lists can represent finite dynamic sets with pointers. In stacks and queues, the removal of elements is prespecified. While stack follows a last-in-first-out (LIFO) policy, queue follows a first-in-first-out (FIFO) policy. Both data structure can be represented with a simple array where all of its operations runs in O(1) time: https://bit.ly/af-stack, https://bit.ly/af-queue. Unlike array in which linear order is determined by array indices, the order in linked list is determined by a pointer in each object. Linked list comes in many forms including but not limited to singly-linked, doubly-linked, sorter, unsorted, and circular. While an insert in a doubly-linked list can run in linear time, search can take O(n) in the worst case since it may have to search the entire list: https://bit.ly/af-linked-list.",
            "citation": "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, and Clifford Stein. 2009. Introduction to Algorithms, Third Edition (3rd. ed.). The MIT Press.",
            "tags": ["computer science,", " summary"]
        },
        {
            "title": "Bioinformatics",
            "date": "04/29/2020",
            "summary": "Bioinformatics is the collection, management, and analysis of biological information. It is an interdisciplinary field of biology, math, physics, computer science, and medicine. Bioinformatics supports -omics research. The three most common ones are the study of genomics (DNA) which attempt to understand the interaction between genes and genes-environment, transcriptomics (RNA) which reveals mRNA expression level, and proteomics (Protein) which studies protein's structure and function. In bioinformatics, information techniques are applied on the physical chemistry data of molecules to understand and organize data to large-scale: 'bench -> bed'. Besides medical application, bioinformatics can also be used in non-medical field such as energy and environment, agriculture, risk management and mitigation, and forensic science. The increasing advancement of sequencing tools will allow more biological information to be explored. Accompanying to this advancement however are challenges found in data security, data storage, data visualization, and the lack of standard within bioinformatics data.",
            "citation": "https://www.slideshare.net/JTADrexel/bioinformatics-2512758",
            "tags": ["bioinformatics,", " summary"]
        },
        {
            "title": "Proto-oncogenes",
            "date": "04/29/2020",
            "summary": "Cancer cells are generally induced by activated photo-oncogenes — genes that when mutated cause normal cells to become cancer cells. The mutated version of proto-oncogenes is termed “oncogenes” and it disrupts cell regulation by promoting cell proliferation, inhibiting cell differentiation, or halting cell death. So, how does proto-oncogene become oncogene? Oncogene is a result of high expression level of mutations in proto-oncogene. Genetic mechanism that can induce oncogene activation includes: 1) Point mutation, deletion, insertions that leads to a hyperactive gene 2) Point mutation, deletion, insertion in the promoter region that leads to aberrant transcription 3) Gene amplifications events producing extra chromosomal copies of proto-oncogene 4) Chromosomal translocation events that relocate proto-oncogene to a new chromosomal site that leads to higher expression 5) Chromosomal translocations that lead to a fusion between a proto-oncogene and a second gene, which produces a fusion protein with oncogenic activity. It is important to note that cancer is most likely to be a multistep process during which cells acquire a series of mutations that collectively lead to increased proto-oncogene function. Thus, targeting specific oncogene is never enough to defeat cancer due to the complex nature of its formation in the first place.",
            "citation": "Chial, H. (2008) Proto-oncogenes to oncogenes to cancer. Nature Education 1(1):33",
            "tags": ["biology,", " summary"]
        }
    ]
}
